JuulLabs/mynewt-core/hw/mcu/nordic/nrf52xxx/src/hal_i2c.c
    my_dbg_error = 0;
    my_dbg_stop = 0;

    regs->EVENTS_ERROR = 0;
    regs->EVENTS_STOPPED = 0;

//    regs->TASKS_RESUME  = 1;
    /* If a transaction was previously suspended, resume it */
    if (regs->EVENTS_SUSPENDED) {
        regs->TASKS_RESUME = 1;
        regs->EVENTS_SUSPENDED = 0;
        return rc;
    }

    regs->TASKS_STARTTX = 1;

    // Enable interrupts for STOPPED and ERROR
    regs->INTENSET = NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;

    // note: some anomaly 109 workaround stuff would go here
    start = os_time_get();
    g_start = os_cputime_get32();

    while (!my_dbg_stop) {
        now = os_time_get();
        if (OS_TIME_TICK_GT(now, start + timo)) {
            rc = HAL_I2C_ERR_TIMEOUT;
            console_printf("<>wrrd timeout: a=%x<>\n",pdata->address);
            goto err;
        }
    }
//    console_printf("<>wrrd stop a=%x r=%x<>\n", pdata->address, pdata->buffer1[0]);

    // these are done by nrfx irq handler upon STOPPED condition
    regs->EVENTS_STOPPED = 0;
    regs->EVENTS_LASTTX = 0;
    regs->EVENTS_LASTRX = 0;
    regs->EVENTS_ERROR = 0;

    if (my_dbg_error) {
        rc = my_dbg_error;
        switch(my_dbg_error)
        {
            case HAL_I2C_ERR_DATA_NACK:
                console_printf("<>i2c error: DATA_NAK<>\n");
            break;
            case HAL_I2C_ERR_ADDR_NACK:
                console_printf("<>i2c error: ADDR_NAK<>\n");
            break;
            case HAL_I2C_ERR_OVERRUN:
                console_printf("<>i2c error: OVERRUN<>\n");
                break;
            case HAL_I2C_ERR_UNKNOWN:
            default:
                console_printf("<>i2c error: UNKNOWN<>\n");
                break;
        }
        goto err;
    }

    /* Save the current last op to detect bus errors later */
//    i2c->nhi_prev_last_op = last_op;

    return 0;
err:
    return hal_i2c_handle_errors(i2c, rc, start + timo);
}


int
hal_i2c_master_probe(uint8_t i2c_num, uint8_t address, uint32_t timo)
{
    struct hal_i2c_master_data rx;
    uint8_t buf;

    rx.address = address;
    rx.buffer = &buf;
    rx.len = 1;

    return hal_i2c_master_read(i2c_num, &rx, timo, 1);
}

#if 0
static void nrf_twim_event_clear(NRF_TWIM_Type * p_reg,
                                          uint32_t event)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event)) = 0x0UL;
#if __CORTEX_M == 0x04
    volatile uint32_t dummy = *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event));
    (void)dummy;
#endif
}
#endif
